In [ ]:
Khandare Pavan Haribhau
M.Sc. Computer Science
IIIrd Semester 
Pattern Recognition

In [ ]:
Assignment 6 : Predict salary of HR using Pandas, numpy, sklearn and matplotlib.

In [1]:
import pandas as pd
import numpy as np
from sklearn import linear_model
import matplotlib.pyplot as plt
import math

In [24]:
HRsalary = pd.read_csv("hrsalary.csv")
HRsalary

   experience  test_score  interview_score  salary
0         NaN         8.0                9   50000
1         NaN         8.0                6   45000
2         5.0         6.0                7   60000
3         2.0        10.0               10   65000
4         7.0         9.0                6   70000
5         3.0         7.0               10   62000
6        10.0         NaN                7   72000
7        11.0         7.0                8   80000

In [25]:
HRsalary.salary.median()

63500.0

In [34]:
HRsalary.test_score.median()

8.0

In [35]:
HRsalary.test_score = HRsalary.test_score.fillna(HRsalary.test_score.median())

In [36]:
HRsalary

   experience  test_score  interview_score  salary
0         6.0         8.0                9   50000
1         6.0         8.0                6   45000
2         5.0         6.0                7   60000
3         2.0        10.0               10   65000
4         7.0         9.0                6   70000
5         3.0         7.0               10   62000
6        10.0         8.0                7   72000
7        11.0         7.0                8   80000

In [20]:
salary.experience.median()

6.0

In [26]:
HRsalary.experience = HRsalary.experience.fillna(HRsalary.experience.median())

In [38]:
HRsalary

   experience  test_score  interview_score  salary
0         6.0         8.0                9   50000
1         6.0         8.0                6   45000
2         5.0         6.0                7   60000
3         2.0        10.0               10   65000
4         7.0         9.0                6   70000
5         3.0         7.0               10   62000
6        10.0         8.0                7   72000
7        11.0         7.0                8   80000

In [39]:
dropped = HRsalary.drop('salary',axis='columns')
dropped

   experience  test_score  interview_score
0         6.0         8.0                9
1         6.0         8.0                6
2         5.0         6.0                7
3         2.0        10.0               10
4         7.0         9.0                6
5         3.0         7.0               10
6        10.0         8.0                7
7        11.0         7.0                8

In [40]:
model = linear_model.LinearRegression()
model.fit(HRsalary.drop('salary',axis='columns'), HRsalary.salary)

LinearRegression(copy_X=True, fit_intercept=True, n_jobs=None, normalize=False)

In [41]:
model.predict([[2,9,6]])

array([47056.91056911])

In [42]:
model.predict([[12,10,10]])

array([88227.64227642])